
            //* ----------------------------------- TASK THREE ----------------------------


            

              
// const numbers = [1, 2, 3, 4, 5];


        //* ----------------------------------- Делим  значения каждого числа из массива ----------------------------
// const divide = numbers.map ((a) => {
//     return a / 2;});
// console.log(divide);



        //* ----------------------------------- Утроенное значения каждого числа из массива ----------------------------
// const multiThree = numbers.map ((a) => {
//     return a * 3;
// });
// console.log(multiThree);


             //* ----------------------------------- Удвоенные значения каждого числа из массива ---------------------------- 
// const double = numbers.map((a) => {
// return a * 2 ;});
// console.log(double);





            //* ----------------------------------- TASK ONE ----------------------------

const names = ['Alice', 'Bob', 'Charlie', 'CARL' , 'Антон', 'serge', 'KaTe', 'sImon'];




                //* ------------------------------ Массив который содержит кол-во букв -----------------------
// const num = names.map((a) => {
// return a.length;});
// console.log(num);




                //* ------------------------------ Имена из массива в Нижним Регистре -----------------------
// const lower = names.map ((a) => {
//     return a.toLowerCase()
// });
// console.log(lower);


                //* ------------------------------ Имена из массива в Верхнем Регистре -----------------------
// const upper = names.map ((a) => {
//     return a.toUpperCase();
// });
// console.log(upper);









            //* ----------------------------------- TASK TWO ----------------------------
// let fruits = [
//   {
//     name: 'Apple',
//     id: 1,
//    price: 10,
//   },
//   {
//     name: 'Orange',
//     id: 2,
//     price: 20,
//   },
//   {
//     name: 'Grape',
//     id: 3,
//     price: 30,
//   },
// ];

            // * -------------------------------- ЦЕНА  ФРУКТОВ --------------------------------
//  const price = fruits.map (a => a.price);
//  console.log(price);
            

            // * -------------------------------- ID ФРУКТОВ --------------------------------
// const id = fruits.map ( a => a.id);
// console.log(id);


            // * -------------------------------- НАЗВАПНИЕ ФРУКТОВ --------------------------
// const fruitsName = fruits.map(fruits => fruits.name);
// console.log(fruitsName);

