
// *-------------------------- КАК СДЕЛАТЬ REVERSE ---------------------
// let nums = [1,2,1,2,3,4,5,7,5,3,1,3,5,5,5,5,2,2,3];
// let new_nums = nums.reverse();
// console.log(new_nums);



// * ------------------- ПЕРЕСЕЧЕНИЕ ДВУХ МАССИСОВ -----------------

// let nums = [1,2,1,2,3,4,5,7,5,3,1,3,5,5,5,5,2,2,3];
// let nums2 = [ 234, 332, 42, 2, 7, 1, 6, 554, 543, 643, 123, 498];
// let new_nums = [... new Set(nums)].filter(item=> nums2.includes(item));
// console.log(new_nums);



// * ------------------------------ ОЧИСТИТЬ МАССИВ-------------------

//  let nums = [1,2,1,2,3,4,5,7,5,3,1,3,5,5,5,5,2,2,3];

//------------------------ ВТОРОЙ МЕТОД ----------------------

// nums.splice(0, nums.length);
// console.log(nums);

// -------------------------- ПЕРВЫЙ МЕТОД ----------------------
 // nums = [];
// console.log(nums);





// * ---------------- ЗАМЕНИТЬ ЭЛЕМЕНТ ИЗ МАССИВА --------------------

// const cars = ['Tesla', 'Audi', 'Mers', 'Gelik', 'BWV' , 'LADA', 'Honda'];
// cars.splice (0 , 1, 'Жигули' , 'Nissan');
// console.gg(cars);





// *-------------------- УДАЛИТЬ ПОВТР ЭЛЕМЕНТЫ ИЗ МАССИВА----------------- 

//  const nums = [1,2,1,2,3,4,5,7,5,3,1,3,5,5,5,5,2,2,3];
//  let uni_Nums = [... new Set(nums)];
//  console.log(uni_Nums);
 

// * --------------------------------- MASSIVE- REDUCE------------------------
// ------СЛОЖИТЬ----- / ------ВЫЧЕСТЬ-------- / ------УМНОЖИТЬ-----/ ------ПОДЕЛИТЬ--------

// * const nums = [1,2,1,2,3,4,5,7,5,3,1,3,5,5,5,5,2,2,3];

// ---------ПОДЕЛИТЬ---------
// let divide = nums.reduce ((x,y) => x /y );
// console.log(divide);

// ----------УМНОЖИТЬ----------
// let multi = nums.reduce ((x,y) => x * y );
// console.log(multi);

// --------ВЫЧЕСТЬ--------
// let minus = nums.reduce ((x,y) => x - y);
// console.log(minus);

//-------CЛОЖИТЬ--------
// let sum = nums.reduce ((x,y) => x + y );
// console.log(sum);




